[Killed] BlockStatement
src/lib/ai.js:16:40
  * Clean markdown code blocks from AI responses
  * Used throughout this file to parse JSON responses
  */
-function cleanMarkdownCodeBlocks(text) {
-    let cleaned = text.trim();
-    if (cleaned.startsWith('```json')) {
-        cleaned = cleaned.replace(/```json\n?/, '').replace(/\n?```$/, '');
-    } else if (cleaned.startsWith('```')) {
-        cleaned = cleaned.replace(/```\n?/, '').replace(/\n?```$/, '');
-    }
-    return cleaned.trim();
-}
+function cleanMarkdownCodeBlocks(text) {}
 
 
killedBy: ai library generatequerysuggestions should generate query suggestions from schema
statusReason: Error: Failed to generate query suggestions: Failed to parse AI response: "undefined" is not valid JSON

[Killed] MethodExpression
src/lib/ai.js:17:19
  * Used throughout this file to parse JSON responses
  */
 function cleanMarkdownCodeBlocks(text) {
-    let cleaned = text.trim();
+    let cleaned = text;
     if (cleaned.startsWith('```json')) {
         cleaned = cleaned.replace(/```json\n?/, '').replace(/\n?```$/, '');
killedBy: ai library generatequerysuggestions Additional edge cases to improve mutation score schemaToUML should accept responses with extra whitespace/newlines around markers
statusReason: Error: Failed to convert schema to PlantUML: Invalid PlantUML code returned from AI

[Killed] MethodExpression
src/lib/ai.js:18:9
  */
 function cleanMarkdownCodeBlocks(text) {
     let cleaned = text.trim();
-    if (cleaned.startsWith('```json')) {
+    if (cleaned.endsWith('```json')) {
         cleaned = cleaned.replace(/```json\n?/, '').replace(/\n?```$/, '');
     } else if (cleaned.startsWith('```')) {
killedBy: ai library generatequerysuggestions should handle markdown code blocks in response
statusReason: Error: Failed to generate query suggestions: Failed to parse AI response: Unexpected token 'j', "json
["Que"... is not valid JSON

[Killed] ConditionalExpression
src/lib/ai.js:18:9
  */
 function cleanMarkdownCodeBlocks(text) {
     let cleaned = text.trim();
-    if (cleaned.startsWith('```json')) {
+    if (false) {
         cleaned = cleaned.replace(/```json\n?/, '').replace(/\n?```$/, '');
     } else if (cleaned.startsWith('```')) {
killedBy: ai library generatequerysuggestions should handle markdown code blocks in response
statusReason: Error: Failed to generate query suggestions: Failed to parse AI response: Unexpected token 'j', "json
["Que"... is not valid JSON

[Killed] StringLiteral
src/lib/ai.js:19:72
 function cleanMarkdownCodeBlocks(text) {
     let cleaned = text.trim();
     if (cleaned.startsWith('```json')) {
-        cleaned = cleaned.replace(/```json\n?/, '').replace(/\n?```$/, '');
+        cleaned = cleaned.replace(/```json\n?/, '').replace(/\n?```$/, "Stryker was here!");
     } else if (cleaned.startsWith('```')) {
         cleaned = cleaned.replace(/```\n?/, '').replace(/\n?```$/, '');
killedBy: ai library generatequerysuggestions should handle markdown code blocks in response
statusReason: Error: Failed to generate query suggestions: Failed to parse AI response: Unexpected non-whitespace character after JSON at position 22 (line 1 column 23)

[Survived] Regex
src/lib/ai.js:19:35
 function cleanMarkdownCodeBlocks(text) {
     let cleaned = text.trim();
     if (cleaned.startsWith('```json')) {
-        cleaned = cleaned.replace(/```json\n?/, '').replace(/\n?```$/, '');
+        cleaned = cleaned.replace(/```json\n/, '').replace(/\n?```$/, '');
     } else if (cleaned.startsWith('```')) {
         cleaned = cleaned.replace(/```\n?/, '').replace(/\n?```$/, '');

[Killed] BlockStatement
src/lib/ai.js:20:43
     let cleaned = text.trim();
     if (cleaned.startsWith('```json')) {
         cleaned = cleaned.replace(/```json\n?/, '').replace(/\n?```$/, '');
-    } else if (cleaned.startsWith('```')) {
-        cleaned = cleaned.replace(/```\n?/, '').replace(/\n?```$/, '');
-    }
+    } else if (cleaned.startsWith('```')) {}
     return cleaned.trim();
 }
killedBy: ai library generatequerysuggestions Additional edge cases to improve mutation score schemaToUML should accept responses with extra whitespace/newlines around markers
statusReason: Error: Failed to convert schema to PlantUML: Invalid PlantUML code returned from AI

[Killed] ConditionalExpression
src/lib/ai.js:20:16
     let cleaned = text.trim();
     if (cleaned.startsWith('```json')) {
         cleaned = cleaned.replace(/```json\n?/, '').replace(/\n?```$/, '');
-    } else if (cleaned.startsWith('```')) {
+    } else if (false) {
         cleaned = cleaned.replace(/```\n?/, '').replace(/\n?```$/, '');
     }
killedBy: ai library generatequerysuggestions Additional edge cases to improve mutation score schemaToUML should accept responses with extra whitespace/newlines around markers
statusReason: Error: Failed to convert schema to PlantUML: Invalid PlantUML code returned from AI

[Killed] StringLiteral
src/lib/ai.js:21:45
     if (cleaned.startsWith('```json')) {
         cleaned = cleaned.replace(/```json\n?/, '').replace(/\n?```$/, '');
     } else if (cleaned.startsWith('```')) {
-        cleaned = cleaned.replace(/```\n?/, '').replace(/\n?```$/, '');
+        cleaned = cleaned.replace(/```\n?/, "Stryker was here!").replace(/\n?```$/, '');
     }
     return cleaned.trim();
killedBy: ai library generatequerysuggestions Additional edge cases to improve mutation score schemaToUML should accept responses with extra whitespace/newlines around markers
statusReason: Error: Failed to convert schema to PlantUML: Invalid PlantUML code returned from AI

[Survived] Regex
src/lib/ai.js:21:57
     if (cleaned.startsWith('```json')) {
         cleaned = cleaned.replace(/```json\n?/, '').replace(/\n?```$/, '');
     } else if (cleaned.startsWith('```')) {
-        cleaned = cleaned.replace(/```\n?/, '').replace(/\n?```$/, '');
+        cleaned = cleaned.replace(/```\n?/, '').replace(/\n?```/, '');
     }
     return cleaned.trim();

[Survived] MethodExpression
src/lib/ai.js:23:12
     } else if (cleaned.startsWith('```')) {
         cleaned = cleaned.replace(/```\n?/, '').replace(/\n?```$/, '');
     }
-    return cleaned.trim();
+    return cleaned;
 }
 

[Killed] StringLiteral
src/lib/ai.js:28:20
 
 
 export async function generatequerysuggestions(schema) {
-    const prompt = `You are a helpful assistant that generates SQL query suggestions based on the provided database schema.
-Database Schema:
-${JSON.stringify(schema, null, 2)}  
-Generate 4 diverse and relevant query suggestions in natural language that a user might want to run against this database.
-The query should target either one or more of the tables in the schema.
-Return ONLY a JSON array of strings (no markdown, no extra text):
-[
-  "SQL query suggestion 1",
-  "SQL query suggestion 2",
-  ...
-]`;
+    const prompt = ``;
 
     try {
killedBy: ai library generatequerysuggestions should generate query suggestions from schema
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "maxTokens": 1000,
    "model": Object {

[Killed] BlockStatement
src/lib/ai.js:40:9
   ...
 ]`;
 
-    try {
-        const { text } = await generateText({
-            model: groq(DEFAULT_MODEL),
-            prompt,
-            temperature: 0.3,
-            maxTokens: 1000,
-        });
-
-        //to clean and parse the response
-        const suggestions = parseAIResponse(text);
-
-        //basic validation
-        if (!Array.isArray(suggestions)) {
-            throw new Error('Invalid suggestions format returned from AI');
-        }
-
-        return suggestions;
-    } catch (error) {
+    try {} catch (error) {
         console.error('Error generating query suggestions:', error);
         throw new Error(`Failed to generate query suggestions: ${error.message}`);
killedBy: ai library generatequerysuggestions should generate query suggestions from schema
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"maxTokens": 1000, "model": {"name": "llama-3.3-70b-versatile"}, "prompt": StringContaining "Generate 4 diverse and relevant query suggestions", "temperature": 0.3}

Number of calls: 0

[Killed] ObjectLiteral
src/lib/ai.js:41:45
 ]`;
 
     try {
-        const { text } = await generateText({
-            model: groq(DEFAULT_MODEL),
-            prompt,
-            temperature: 0.3,
-            maxTokens: 1000,
-        });
+        const { text } = await generateText({});
 
         //to clean and parse the response
killedBy: ai library generatequerysuggestions should generate query suggestions from schema
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "maxTokens": 1000,
-   "model": Object {

[Killed] ConditionalExpression
src/lib/ai.js:52:13
         const suggestions = parseAIResponse(text);
 
         //basic validation
-        if (!Array.isArray(suggestions)) {
+        if (true) {
             throw new Error('Invalid suggestions format returned from AI');
         }
killedBy: ai library generatequerysuggestions should generate query suggestions from schema
statusReason: Error: Failed to generate query suggestions: Invalid suggestions format returned from AI

[Killed] BlockStatement
src/lib/ai.js:52:42
         const suggestions = parseAIResponse(text);
 
         //basic validation
-        if (!Array.isArray(suggestions)) {
-            throw new Error('Invalid suggestions format returned from AI');
-        }
+        if (!Array.isArray(suggestions)) {}
 
         return suggestions;
killedBy: ai library generatequerysuggestions Additional edge cases to improve mutation score cleanMarkdownCodeBlocks should remove only surrounding json fences and preserve inner content
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"a": "```not a fence```"}

[Killed] StringLiteral
src/lib/ai.js:53:29
 
         //basic validation
         if (!Array.isArray(suggestions)) {
-            throw new Error('Invalid suggestions format returned from AI');
+            throw new Error("");
         }
 
killedBy: ai library generatequerysuggestions should throw error when response is not an array
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Invalid suggestions format returned from AI"
Received message:   "Failed to generate query suggestions: "

      135 |         stryCov_9fa48("34");
      136 |         console.error(stryMutAct_9fa48("35") ? "" : (stryCov_9fa48("35"), 'Error generating query suggestions:'), error);
    > 137 |         throw new Error(stryMutAct

[Killed] BlockStatement
src/lib/ai.js:57:21
         }
 
         return suggestions;
-    } catch (error) {
-        console.error('Error generating query suggestions:', error);
-        throw new Error(`Failed to generate query suggestions: ${error.message}`);
-    }
+    } catch (error) {}
 }
 
killedBy: ai library generatequerysuggestions Additional edge cases to improve mutation score cleanMarkdownCodeBlocks should remove only surrounding json fences and preserve inner content
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] StringLiteral
src/lib/ai.js:59:25
         return suggestions;
     } catch (error) {
         console.error('Error generating query suggestions:', error);
-        throw new Error(`Failed to generate query suggestions: ${error.message}`);
+        throw new Error(``);
     }
 }
killedBy: ai library generatequerysuggestions should throw error for invalid response format
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Failed to parse AI response"
Received message:   ""

      135 |         stryCov_9fa48("34");
      136 |         console.error(stryMutAct_9fa48("35") ? "" : (stryCov_9fa48("35"), 'Error generating query suggestions:'), error);
    > 137 |         throw new Error(stryMutAct_9fa48("36") ? `` : (stryCov_9fa48("36"), `Failed to g

[Killed] BlockStatement
src/lib/ai.js:80:9
     6. Use appropriate PlantUML stereotypes for tables and columns.
     Return ONLY valid PlantUML code (no markdown, no extra text).`;
 
-    try {
-        const { text } = await generateText({
-            model: groq(DEFAULT_MODEL),
-            prompt,
-            temperature: 0.3,
-            maxTokens: 2000,
-        });
-
-        //to clean and parse the response
-        const plantUMLCode = cleanMarkdownCodeBlocks(text);
-
-        //basic validation
-        if (!plantUMLCode.startsWith('@startuml') || !plantUMLCode.endsWith('@enduml')) {
-            throw new Error('Invalid PlantUML code returned from AI');
-        }
-
-        return plantUMLCode;
-    } catch (error) {
+    try {} catch (error) {
         console.error('Error converting schema to PlantUML:', error);
         throw new Error(`Failed to convert schema to PlantUML: ${error.message}`);
killedBy: ai library generatequerysuggestions Additional edge cases to improve mutation score schemaToUML should accept responses with extra whitespace/newlines around markers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "@startuml
class users
@enduml"
Received: undefined

[Killed] MethodExpression
src/lib/ai.js:92:14
         const plantUMLCode = cleanMarkdownCodeBlocks(text);
 
         //basic validation
-        if (!plantUMLCode.startsWith('@startuml') || !plantUMLCode.endsWith('@enduml')) {
+        if (!plantUMLCode.endsWith('@startuml') || !plantUMLCode.endsWith('@enduml')) {
             throw new Error('Invalid PlantUML code returned from AI');
         }
killedBy: ai library generatequerysuggestions Additional edge cases to improve mutation score schemaToUML should accept responses with extra whitespace/newlines around markers
statusReason: Error: Failed to convert schema to PlantUML: Invalid PlantUML code returned from AI

[Killed] ConditionalExpression
src/lib/ai.js:92:13
         const plantUMLCode = cleanMarkdownCodeBlocks(text);
 
         //basic validation
-        if (!plantUMLCode.startsWith('@startuml') || !plantUMLCode.endsWith('@enduml')) {
+        if (false) {
             throw new Error('Invalid PlantUML code returned from AI');
         }
killedBy: ai library schemaToUML should throw error for invalid PlantUML format
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: "invalid uml code"

[Killed] StringLiteral
src/lib/ai.js:93:29
 
         //basic validation
         if (!plantUMLCode.startsWith('@startuml') || !plantUMLCode.endsWith('@enduml')) {
-            throw new Error('Invalid PlantUML code returned from AI');
+            throw new Error("");
         }
 
killedBy: ai library schemaToUML should throw error for invalid PlantUML format
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Invalid PlantUML code returned from AI"
Received message:   "Failed to convert schema to PlantUML: "

      195 |         stryCov_9fa48("52");
      196 |         console.error(stryMutAct_9fa48("53") ? "" : (stryCov_9fa48("53"), 'Error converting schema to PlantUML:'), error);
    > 197 |         throw new Error(stryMutAct_9fa

[Killed] BlockStatement
src/lib/ai.js:97:21
         }
 
         return plantUMLCode;
-    } catch (error) {
-        console.error('Error converting schema to PlantUML:', error);
-        throw new Error(`Failed to convert schema to PlantUML: ${error.message}`);
-    }
+    } catch (error) {}
 }
 
killedBy: ai library schemaToUML should throw error for invalid PlantUML format
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Survived] StringLiteral
src/lib/ai.js:98:23
 
         return plantUMLCode;
     } catch (error) {
-        console.error('Error converting schema to PlantUML:', error);
+        console.error("", error);
         throw new Error(`Failed to convert schema to PlantUML: ${error.message}`);
     }

[Killed] BlockStatement
src/lib/ai.js:107:32
 /**
  * Parse JSON response from AI with error handling
  */
-function parseAIResponse(text) {
-    try {
-        const cleaned = cleanMarkdownCodeBlocks(text);
-        return JSON.parse(cleaned);
-    } catch (error) {
-        throw new Error(`Failed to parse AI response: ${error.message}`);
-    }
-}
+function parseAIResponse(text) {}
 
 /**
killedBy: ai library generatequerysuggestions should generate query suggestions from schema
statusReason: Error: Failed to generate query suggestions: Invalid suggestions format returned from AI

[Killed] BlockStatement
src/lib/ai.js:108:9
  * Parse JSON response from AI with error handling
  */
 function parseAIResponse(text) {
-    try {
-        const cleaned = cleanMarkdownCodeBlocks(text);
-        return JSON.parse(cleaned);
-    } catch (error) {
+    try {} catch (error) {
         throw new Error(`Failed to parse AI response: ${error.message}`);
     }
killedBy: ai library generatequerysuggestions should generate query suggestions from schema
statusReason: Error: Failed to generate query suggestions: Invalid suggestions format returned from AI

[Killed] BlockStatement
src/lib/ai.js:111:21
     try {
         const cleaned = cleanMarkdownCodeBlocks(text);
         return JSON.parse(cleaned);
-    } catch (error) {
-        throw new Error(`Failed to parse AI response: ${error.message}`);
-    }
+    } catch (error) {}
 }
 
killedBy: ai library generatequerysuggestions should throw error for invalid response format
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Failed to parse AI response"
Received message:   "Failed to generate query suggestions: Invalid suggestions format returned from AI"

      135 |         stryCov_9fa48("34");
      136 |         console.error(stryMutAct_9fa48("35") ? "" : (stryCov_9fa48("35"), 'Error generating query suggestions:'), error);
    > 137 |

[Timeout] BlockStatement
src/lib/ai.js:159:9
 - Use TIMESTAMP WITH TIME ZONE for date/time columns
 - Be specific about VARCHAR lengths (e.g., VARCHAR(255))`;
 
-    try {
-        const { text } = await generateText({
-            model: groq(DEFAULT_MODEL),
-            prompt,
-            temperature: 0.3,
-            maxTokens: 2000,
-        });
-
-        // Use helper function instead of duplicate code
-        const schema = parseAIResponse(text);
-
-        // Validate schema structure
-        if (!schema.projectName || !schema.tables || !Array.isArray(schema.tables)) {
-            throw new Error('Invalid schema structure returned from AI');
-        }
-
-        return schema;
-    } catch (error) {
+    try {} catch (error) {
         console.error('Error inferring database schema:', error);
         throw new Error(`Failed to infer database schema: ${error.message}`);

[Killed] LogicalOperator
src/lib/ai.js:171:13
         const schema = parseAIResponse(text);
 
         // Validate schema structure
-        if (!schema.projectName || !schema.tables || !Array.isArray(schema.tables)) {
+        if (!schema.projectName && !schema.tables || !Array.isArray(schema.tables)) {
             throw new Error('Invalid schema structure returned from AI');
         }
killedBy: ai library Mutation Resistance Tests Schema validation for inferDatabaseSchema should validate projectName exists
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"description": "test", "tables": []}

[Killed] ConditionalExpression
src/lib/ai.js:171:13
         const schema = parseAIResponse(text);
 
         // Validate schema structure
-        if (!schema.projectName || !schema.tables || !Array.isArray(schema.tables)) {
+        if (false) {
             throw new Error('Invalid schema structure returned from AI');
         }
killedBy: ai library inferDatabaseSchema should throw error for invalid schema structure
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"invalid": "schema"}

[Timeout] BlockStatement
src/lib/ai.js:176:21
         }
 
         return schema;
-    } catch (error) {
-        console.error('Error inferring database schema:', error);
-        throw new Error(`Failed to infer database schema: ${error.message}`);
-    }
+    } catch (error) {}
 }
 

[Timeout] StringLiteral
src/lib/ai.js:177:23
 
         return schema;
     } catch (error) {
-        console.error('Error inferring database schema:', error);
+        console.error("", error);
         throw new Error(`Failed to infer database schema: ${error.message}`);
     }

[Timeout] BlockStatement
src/lib/ai.js:187:55
  * @param {Array} tables - Array of table definitions
  * @returns {Array<string>} - Array of CREATE TABLE SQL statements
  */
-export function generateCreateTableStatements(tables) {
-    return tables.map(table => {
-        const columns = table.columns.map(col => {
-            let definition = `${col.name} ${col.type}`;
-
-            if (col.constraints && Array.isArray(col.constraints)) {
-                definition += ' ' + col.constraints.join(' ');
-            }
-
-            if (col.references) {
-                definition += ` REFERENCES ${col.references}`;
-            }
-
-            return definition;
-        }).join(',\n    ');
-
-        return `CREATE TABLE ${table.name} (\n    ${columns}\n);`;
-    }).join('\n\n');
-}
+export function generateCreateTableStatements(tables) {}
 
 /**

[Timeout] BlockStatement
src/lib/ai.js:188:32
  * @returns {Array<string>} - Array of CREATE TABLE SQL statements
  */
 export function generateCreateTableStatements(tables) {
-    return tables.map(table => {
-        const columns = table.columns.map(col => {
-            let definition = `${col.name} ${col.type}`;
-
-            if (col.constraints && Array.isArray(col.constraints)) {
-                definition += ' ' + col.constraints.join(' ');
-            }
-
-            if (col.references) {
-                definition += ` REFERENCES ${col.references}`;
-            }
-
-            return definition;
-        }).join(',\n    ');
-
-        return `CREATE TABLE ${table.name} (\n    ${columns}\n);`;
-    }).join('\n\n');
+    return tables.map(table => {}).join('\n\n');
 }
 

[Timeout] BlockStatement
src/lib/ai.js:189:50
  */
 export function generateCreateTableStatements(tables) {
     return tables.map(table => {
-        const columns = table.columns.map(col => {
-            let definition = `${col.name} ${col.type}`;
-
-            if (col.constraints && Array.isArray(col.constraints)) {
-                definition += ' ' + col.constraints.join(' ');
-            }
-
-            if (col.references) {
-                definition += ` REFERENCES ${col.references}`;
-            }
-
-            return definition;
-        }).join(',\n    ');
+        const columns = table.columns.map(col => {}).join(',\n    ');
 
         return `CREATE TABLE ${table.name} (\n    ${columns}\n);`;

[Killed] ConditionalExpression
src/lib/ai.js:192:17
         const columns = table.columns.map(col => {
             let definition = `${col.name} ${col.type}`;
 
-            if (col.constraints && Array.isArray(col.constraints)) {
+            if (false) {
                 definition += ' ' + col.constraints.join(' ');
             }
killedBy: ai library generateCreateTableStatements should generate CREATE TABLE SQL from table definitions
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "id UUID PRIMARY KEY"
Received string:    "CREATE TABLE users (
    id UUID,
    email VARCHAR(255)
);"

[Killed] BlockStatement
src/lib/ai.js:192:68
         const columns = table.columns.map(col => {
             let definition = `${col.name} ${col.type}`;
 
-            if (col.constraints && Array.isArray(col.constraints)) {
-                definition += ' ' + col.constraints.join(' ');
-            }
+            if (col.constraints && Array.isArray(col.constraints)) {}
 
             if (col.references) {
killedBy: ai library generateCreateTableStatements should generate CREATE TABLE SQL from table definitions
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "id UUID PRIMARY KEY"
Received string:    "CREATE TABLE users (
    id UUID,
    email VARCHAR(255)
);"

[Killed] AssignmentOperator
src/lib/ai.js:193:17
             let definition = `${col.name} ${col.type}`;
 
             if (col.constraints && Array.isArray(col.constraints)) {
-                definition += ' ' + col.constraints.join(' ');
+                definition -= ' ' + col.constraints.join(' ');
             }
 
killedBy: ai library generateCreateTableStatements should generate CREATE TABLE SQL from table definitions
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "id UUID PRIMARY KEY"
Received string:    "CREATE TABLE users (
    NaN,
    NaN
);"

[Timeout] StringLiteral
src/lib/ai.js:193:58
             let definition = `${col.name} ${col.type}`;
 
             if (col.constraints && Array.isArray(col.constraints)) {
-                definition += ' ' + col.constraints.join(' ');
+                definition += ' ' + col.constraints.join("");
             }
 

[Timeout] ConditionalExpression
src/lib/ai.js:196:17
                 definition += ' ' + col.constraints.join(' ');
             }
 
-            if (col.references) {
+            if (true) {
                 definition += ` REFERENCES ${col.references}`;
             }

[Timeout] ConditionalExpression
src/lib/ai.js:196:17
                 definition += ' ' + col.constraints.join(' ');
             }
 
-            if (col.references) {
+            if (false) {
                 definition += ` REFERENCES ${col.references}`;
             }

[Timeout] StringLiteral
src/lib/ai.js:197:31
             }
 
             if (col.references) {
-                definition += ` REFERENCES ${col.references}`;
+                definition += ``;
             }
 

[Killed] StringLiteral
src/lib/ai.js:203:16
             return definition;
         }).join(',\n    ');
 
-        return `CREATE TABLE ${table.name} (\n    ${columns}\n);`;
+        return ``;
     }).join('\n\n');
 }
killedBy: ai library generatequerysuggestions Additional edge cases to improve mutation score generateCreateTableStatements should preserve join separators exactly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "CREATE TABLE a (
    c1 INT,
    c2 TEXT
);"
Received: ""

[Timeout] EqualityOperator
src/lib/ai.js:214:27
  * @returns {Promise<{action: string, proposed_sql: string, explaination: string, requires_confirmation: boolean}>}
  */
 export async function analyzeCreateTableRequest(naturalLanguageInput, existingSchema) {
-    const schemaContext = existingSchema.length > 0
+    const schemaContext = existingSchema.length >= 0
         ? `Existing tables in database:\n${existingSchema.map(t => `- ${t.name}: ${t.columns.map(c => `${c.name} (${c.type})`).join(', ')}`).join('\n')}`
         : 'Database is currently empty.';

[Timeout] ConditionalExpression
src/lib/ai.js:214:27
  * @returns {Promise<{action: string, proposed_sql: string, explaination: string, requires_confirmation: boolean}>}
  */
 export async function analyzeCreateTableRequest(naturalLanguageInput, existingSchema) {
-    const schemaContext = existingSchema.length > 0
+    const schemaContext = true
         ? `Existing tables in database:\n${existingSchema.map(t => `- ${t.name}: ${t.columns.map(c => `${c.name} (${c.type})`).join(', ')}`).join('\n')}`
         : 'Database is currently empty.';

[Timeout] ArrowFunction
src/lib/ai.js:215:98
  */
 export async function analyzeCreateTableRequest(naturalLanguageInput, existingSchema) {
     const schemaContext = existingSchema.length > 0
-        ? `Existing tables in database:\n${existingSchema.map(t => `- ${t.name}: ${t.columns.map(c => `${c.name} (${c.type})`).join(', ')}`).join('\n')}`
+        ? `Existing tables in database:\n${existingSchema.map(t => `- ${t.name}: ${t.columns.map(() => undefined).join(', ')}`).join('\n')}`
         : 'Database is currently empty.';
 

[Timeout] ArrowFunction
src/lib/ai.js:215:63
  */
 export async function analyzeCreateTableRequest(naturalLanguageInput, existingSchema) {
     const schemaContext = existingSchema.length > 0
-        ? `Existing tables in database:\n${existingSchema.map(t => `- ${t.name}: ${t.columns.map(c => `${c.name} (${c.type})`).join(', ')}`).join('\n')}`
+        ? `Existing tables in database:\n${existingSchema.map(() => undefined).join('\n')}`
         : 'Database is currently empty.';
 

[Timeout] BlockStatement
src/lib/ai.js:240:9
   "requires_confirmation": true
 }`;
 
-    try {
-        const { text } = await generateText({
-            model: groq(DEFAULT_MODEL),
-            prompt,
-            temperature: 0.3,
-            maxTokens: 1500,
-        });
-
-        // Use helper function
-        const result = parseAIResponse(text);
-
-        // Ensure requires_confirmation is always true
-        result.requires_confirmation = true;
-
-        return result;
-    } catch (error) {
+    try {} catch (error) {
         console.error('Error analyzing create table request:', error);
         throw new Error(`Failed to analyze request: ${error.message}`);

[Timeout] ObjectLiteral
src/lib/ai.js:241:45
 }`;
 
     try {
-        const { text } = await generateText({
-            model: groq(DEFAULT_MODEL),
-            prompt,
-            temperature: 0.3,
-            maxTokens: 1500,
-        });
+        const { text } = await generateText({});
 
         // Use helper function
