[Timeout] BooleanLiteral
src/lib/ai.js:252:40
         const result = parseAIResponse(text);
 
         // Ensure requires_confirmation is always true
-        result.requires_confirmation = true;
+        result.requires_confirmation = false;
 
         return result;

[Killed] BlockStatement
src/lib/ai.js:255:21
         result.requires_confirmation = true;
 
         return result;
-    } catch (error) {
-        console.error('Error analyzing create table request:', error);
-        throw new Error(`Failed to analyze request: ${error.message}`);
-    }
+    } catch (error) {}
 }
 
killedBy: ai library analyzeCreateTableRequest should throw error when AI fails
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] StringLiteral
src/lib/ai.js:269:103
  * @param {string} projectName - Name of the project for context
  * @returns {Promise<{operations: Array, summary: string, requires_confirmation: boolean}>}
  */
-export async function analyzeProjectUpdateRequest(naturalLanguageInput, existingSchema, projectName = 'database') {
+export async function analyzeProjectUpdateRequest(naturalLanguageInput, existingSchema, projectName = "") {
     const schemaContext = existingSchema.length > 0
         ? existingSchema.map(t => {
killedBy: ai library generatequerysuggestions Additional edge cases to improve mutation score analyzeProjectUpdateRequest should include project name when provided and default when not
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Project: database"
Received string:    "You are a database architect analyzing an update request for an existing database project.·
Project:··
Current Database Schema:
Database is currently empty.·
User's Update Request: \"noop\"·

[Killed] ConditionalExpression
src/lib/ai.js:270:27
  * @returns {Promise<{operations: Array, summary: string, requires_confirmation: boolean}>}
  */
 export async function analyzeProjectUpdateRequest(naturalLanguageInput, existingSchema, projectName = 'database') {
-    const schemaContext = existingSchema.length > 0
+    const schemaContext = false
         ? existingSchema.map(t => {
             const columns = t.columns.map(c => {
killedBy: ai library analyzeProjectUpdateRequest should handle schema with nullable and constraint properties
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "NOT NULL"
Received string:    "You are a database architect analyzing an update request for an existing database project.·
Project: blog_db·
Current Database Schema:
Database is currently empty.·
User's Update Request: \"Update posts table\"·

[Killed] EqualityOperator
src/lib/ai.js:270:27
  * @returns {Promise<{operations: Array, summary: string, requires_confirmation: boolean}>}
  */
 export async function analyzeProjectUpdateRequest(naturalLanguageInput, existingSchema, projectName = 'database') {
-    const schemaContext = existingSchema.length > 0
+    const schemaContext = existingSchema.length <= 0
         ? existingSchema.map(t => {
             const columns = t.columns.map(c => {
killedBy: ai library analyzeProjectUpdateRequest should handle schema with nullable and constraint properties
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "NOT NULL"
Received string:    "You are a database architect analyzing an update request for an existing database project.·
Project: blog_db·
Current Database Schema:
Database is currently empty.·
User's Update Request: \"Update posts table\"·

[Killed] BlockStatement
src/lib/ai.js:271:35
  */
 export async function analyzeProjectUpdateRequest(naturalLanguageInput, existingSchema, projectName = 'database') {
     const schemaContext = existingSchema.length > 0
-        ? existingSchema.map(t => {
-            const columns = t.columns.map(c => {
-                let colDef = `${c.name} (${c.type})`;
-                if (!c.nullable) colDef += ' NOT NULL';
-                if (c.constraint) colDef += ` [${c.constraint}]`;
-                return colDef;
-            }).join(', ');
-            return `Table "${t.name}": ${columns}`;
-        }).join('\n')
+        ? existingSchema.map(t => {}).join('\n')
         : 'Database is currently empty.';
 
killedBy: ai library analyzeProjectUpdateRequest should handle schema with nullable and constraint properties
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "NOT NULL"
Received string:    "You are a database architect analyzing an update request for an existing database project.·
Project: blog_db·
Current Database Schema:··
User's Update Request: \"Update posts table\"·
Analyze the request and determine what database operations needed.··

[Killed] BlockStatement
src/lib/ai.js:272:48
 export async function analyzeProjectUpdateRequest(naturalLanguageInput, existingSchema, projectName = 'database') {
     const schemaContext = existingSchema.length > 0
         ? existingSchema.map(t => {
-            const columns = t.columns.map(c => {
-                let colDef = `${c.name} (${c.type})`;
-                if (!c.nullable) colDef += ' NOT NULL';
-                if (c.constraint) colDef += ` [${c.constraint}]`;
-                return colDef;
-            }).join(', ');
+            const columns = t.columns.map(c => {}).join(', ');
             return `Table "${t.name}": ${columns}`;
         }).join('\n')
killedBy: ai library analyzeProjectUpdateRequest should handle schema with nullable and constraint properties
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "NOT NULL"
Received string:    "You are a database architect analyzing an update request for an existing database project.·
Project: blog_db·
Current Database Schema:
Table \"posts\": , ,··
User's Update Request: \"Update posts table\"·

[Killed] ConditionalExpression
src/lib/ai.js:274:21
         ? existingSchema.map(t => {
             const columns = t.columns.map(c => {
                 let colDef = `${c.name} (${c.type})`;
-                if (!c.nullable) colDef += ' NOT NULL';
+                if (false) colDef += ' NOT NULL';
                 if (c.constraint) colDef += ` [${c.constraint}]`;
                 return colDef;
killedBy: ai library analyzeProjectUpdateRequest should handle schema with nullable and constraint properties
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "NOT NULL"
Received string:    "You are a database architect analyzing an update request for an existing database project.·
Project: blog_db·
Current Database Schema:
Table \"posts\": id (UUID) [PRIMARY KEY], title (VARCHAR(255)), content (TEXT)·
User's Update Request: \"Update posts table\"·

[Killed] BooleanLiteral
src/lib/ai.js:274:21
         ? existingSchema.map(t => {
             const columns = t.columns.map(c => {
                 let colDef = `${c.name} (${c.type})`;
-                if (!c.nullable) colDef += ' NOT NULL';
+                if (c.nullable) colDef += ' NOT NULL';
                 if (c.constraint) colDef += ` [${c.constraint}]`;
                 return colDef;
killedBy: ai library Mutation Resistance Tests analyzeProjectUpdateRequest with various schema properties should handle columns with nullable false
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "NOT NULL"
Received string:    "You are a database architect analyzing an update request for an existing database project.·
Project: database·
Current Database Schema:
Table \"users\": id (UUID)·
User's Update Request: \"test\"·

[Killed] ConditionalExpression
src/lib/ai.js:275:21
             const columns = t.columns.map(c => {
                 let colDef = `${c.name} (${c.type})`;
                 if (!c.nullable) colDef += ' NOT NULL';
-                if (c.constraint) colDef += ` [${c.constraint}]`;
+                if (false) colDef += ` [${c.constraint}]`;
                 return colDef;
             }).join(', ');
killedBy: ai library Mutation Resistance Tests analyzeProjectUpdateRequest with various schema properties should handle columns with constraint property
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "[PRIMARY KEY]"
Received string:    "You are a database architect analyzing an update request for an existing database project.·
Project: database·
Current Database Schema:
Table \"users\": id (UUID) NOT NULL·
User's Update Request: \"test\"·

[Survived] ConditionalExpression
src/lib/ai.js:275:21
             const columns = t.columns.map(c => {
                 let colDef = `${c.name} (${c.type})`;
                 if (!c.nullable) colDef += ' NOT NULL';
-                if (c.constraint) colDef += ` [${c.constraint}]`;
+                if (true) colDef += ` [${c.constraint}]`;
                 return colDef;
             }).join(', ');

[Survived] StringLiteral
src/lib/ai.js:277:21
                 if (!c.nullable) colDef += ' NOT NULL';
                 if (c.constraint) colDef += ` [${c.constraint}]`;
                 return colDef;
-            }).join(', ');
+            }).join("");
             return `Table "${t.name}": ${columns}`;
         }).join('\n')

[Survived] StringLiteral
src/lib/ai.js:280:11
             }).join(', ');
             return `Table "${t.name}": ${columns}`;
         }).join('\n')
-        : 'Database is currently empty.';
+        : "";
 
     const prompt = `You are a database architect analyzing an update request for an existing database project.

[Killed] BlockStatement
src/lib/ai.js:345:9
 7. If modifying existing tables, ensure backward compatibility when possible
 8. Use conditional logic for potentially duplicate operations`;
 
-    try {
-        const { text } = await generateText({
-            model: groq(DEFAULT_MODEL),
-            prompt,
-            temperature: 0.3,
-            maxTokens: 3000,
-        });
-
-        // Use helper function
-        const result = parseAIResponse(text);
-
-        // Validate structure
-        if (!result.operations || !Array.isArray(result.operations)) {
-            throw new Error('Invalid response structure: missing operations array');
-        }
-
-        // Ensure requires_confirmation is always true
-        result.requires_confirmation = true;
-
-        return result;
-    } catch (error) {
+    try {} catch (error) {
         console.error('Error analyzing project update request:', error);
         throw new Error(`Failed to analyze update request: ${error.message}`);
killedBy: ai library generatequerysuggestions Additional edge cases to improve mutation score analyzeProjectUpdateRequest should include project name when provided and default when not
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] BooleanLiteral
src/lib/ai.js:357:35
         const result = parseAIResponse(text);
 
         // Validate structure
-        if (!result.operations || !Array.isArray(result.operations)) {
+        if (!result.operations || Array.isArray(result.operations)) {
             throw new Error('Invalid response structure: missing operations array');
         }
killedBy: ai library generatequerysuggestions Additional edge cases to improve mutation score analyzeProjectUpdateRequest should include project name when provided and default when not
statusReason: Error: Failed to analyze update request: Invalid response structure: missing operations array

[Killed] BooleanLiteral
src/lib/ai.js:357:13
         const result = parseAIResponse(text);
 
         // Validate structure
-        if (!result.operations || !Array.isArray(result.operations)) {
+        if (result.operations || !Array.isArray(result.operations)) {
             throw new Error('Invalid response structure: missing operations array');
         }
killedBy: ai library generatequerysuggestions Additional edge cases to improve mutation score analyzeProjectUpdateRequest should include project name when provided and default when not
statusReason: Error: Failed to analyze update request: Invalid response structure: missing operations array

[Killed] StringLiteral
src/lib/ai.js:358:29
 
         // Validate structure
         if (!result.operations || !Array.isArray(result.operations)) {
-            throw new Error('Invalid response structure: missing operations array');
+            throw new Error("");
         }
 
killedBy: ai library analyzeProjectUpdateRequest should throw error for invalid operations structure
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Invalid response structure: missing operations array"
Received message:   "Failed to analyze update request: "

      557 |         stryCov_9fa48("145");
      558 |         console.error(stryMutAct_9fa48("146") ? "" : (stryCov_9fa48("146"), 'Error analyzing project update request:'), error);
    > 559 |         throw new Erro

[Killed] BlockStatement
src/lib/ai.js:365:21
         result.requires_confirmation = true;
 
         return result;
-    } catch (error) {
-        console.error('Error analyzing project update request:', error);
-        throw new Error(`Failed to analyze update request: ${error.message}`);
-    }
+    } catch (error) {}
 }
 
killedBy: ai library analyzeProjectUpdateRequest should throw error for invalid operations structure
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Survived] StringLiteral
src/lib/ai.js:366:23
 
         return result;
     } catch (error) {
-        console.error('Error analyzing project update request:', error);
+        console.error("", error);
         throw new Error(`Failed to analyze update request: ${error.message}`);
     }

[Killed] StringLiteral
src/lib/ai.js:367:25
         return result;
     } catch (error) {
         console.error('Error analyzing project update request:', error);
-        throw new Error(`Failed to analyze update request: ${error.message}`);
+        throw new Error(``);
     }
 }
killedBy: ai library analyzeProjectUpdateRequest should throw error for invalid operations structure
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Invalid response structure: missing operations array"
Received message:   ""

      557 |         stryCov_9fa48("145");
      558 |         console.error(stryMutAct_9fa48("146") ? "" : (stryCov_9fa48("146"), 'Error analyzing project update request:'), error);
    > 559 |         throw new Error(stryMutAct_9fa48("147") ? `` : (

[Killed] BlockStatement
src/lib/ai.js:373:43
 
 // DB summary
 export async function generateDatabaseSummary(schema, statistics, projectName) {
-    const schemaContext = schema.map(t => {
-        const rowCount = statistics[t.name] || 0;
-        const columns = t.columns.map(c => `${c.name} (${c.type})`).join(', ');
-        return `Table "${t.name}" (${rowCount} rows): ${columns}`;
-    }).join('\n');
+    const schemaContext = schema.map(t => {}).join('\n');
 
     const totalTables = schema.length;
killedBy: ai library generateDatabaseSummary should handle tables with zero or missing row counts
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "(0 rows)"
Received string:    "Analyze this database and return a JSON summary.·
Project: empty_project
Schema:··
Stats: 2 tables, 3 columns, 0 records·
Return ONLY this JSON (no markdown):

[Killed] ConditionalExpression
src/lib/ai.js:374:26
 // DB summary
 export async function generateDatabaseSummary(schema, statistics, projectName) {
     const schemaContext = schema.map(t => {
-        const rowCount = statistics[t.name] || 0;
+        const rowCount = true;
         const columns = t.columns.map(c => `${c.name} (${c.type})`).join(', ');
         return `Table "${t.name}" (${rowCount} rows): ${columns}`;
killedBy: ai library generateDatabaseSummary should handle tables with zero or missing row counts
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "(0 rows)"
Received string:    "Analyze this database and return a JSON summary.·
Project: empty_project
Schema: Table \"users\" (true rows): id (UUID), name (VARCHAR)
Table \"posts\" (true rows): id (UUID)
Stats: 2 tables, 3 columns, 0 records·

[Killed] ConditionalExpression
src/lib/ai.js:374:26
 // DB summary
 export async function generateDatabaseSummary(schema, statistics, projectName) {
     const schemaContext = schema.map(t => {
-        const rowCount = statistics[t.name] || 0;
+        const rowCount = false;
         const columns = t.columns.map(c => `${c.name} (${c.type})`).join(', ');
         return `Table "${t.name}" (${rowCount} rows): ${columns}`;
killedBy: ai library generateDatabaseSummary should handle tables with zero or missing row counts
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "(0 rows)"
Received string:    "Analyze this database and return a JSON summary.·
Project: empty_project
Schema: Table \"users\" (false rows): id (UUID), name (VARCHAR)
Table \"posts\" (false rows): id (UUID)
Stats: 2 tables, 3 columns, 0 records·

[Survived] ArrowFunction
src/lib/ai.js:375:39
 export async function generateDatabaseSummary(schema, statistics, projectName) {
     const schemaContext = schema.map(t => {
         const rowCount = statistics[t.name] || 0;
-        const columns = t.columns.map(c => `${c.name} (${c.type})`).join(', ');
+        const columns = t.columns.map(() => undefined).join(', ');
         return `Table "${t.name}" (${rowCount} rows): ${columns}`;
     }).join('\n');

[Killed] ArrowFunction
src/lib/ai.js:380:40
     }).join('\n');
 
     const totalTables = schema.length;
-    const totalColumns = schema.reduce((sum, t) => sum + t.columns.length, 0);
+    const totalColumns = schema.reduce(() => undefined, 0);
     const totalRows = Object.values(statistics).reduce((sum, count) => sum + count, 0);
     const relationships = schema.flatMap(t => t.columns.filter(c => c.foreign_table)).length;
killedBy: ai library Mutation Resistance Tests generateDatabaseSummary statistics handling should calculate totals correctly with multiple tables
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "3 columns"
Received string:    "Analyze this database and return a JSON summary.·
Project: test
Schema: Table \"users\" (100 rows): id (UUID), email (VARCHAR)
Table \"posts\" (50 rows): id (UUID)
Stats: 2 tables, undefined columns, 150 records·

[Survived] ArithmeticOperator
src/lib/ai.js:380:52
     }).join('\n');
 
     const totalTables = schema.length;
-    const totalColumns = schema.reduce((sum, t) => sum + t.columns.length, 0);
+    const totalColumns = schema.reduce((sum, t) => sum - t.columns.length, 0);
     const totalRows = Object.values(statistics).reduce((sum, count) => sum + count, 0);
     const relationships = schema.flatMap(t => t.columns.filter(c => c.foreign_table)).length;

[Killed] ArrowFunction
src/lib/ai.js:381:56
 
     const totalTables = schema.length;
     const totalColumns = schema.reduce((sum, t) => sum + t.columns.length, 0);
-    const totalRows = Object.values(statistics).reduce((sum, count) => sum + count, 0);
+    const totalRows = Object.values(statistics).reduce(() => undefined, 0);
     const relationships = schema.flatMap(t => t.columns.filter(c => c.foreign_table)).length;
 
killedBy: ai library Mutation Resistance Tests generateDatabaseSummary statistics handling should calculate totals correctly with multiple tables
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "150 records"
Received string:    "Analyze this database and return a JSON summary.·
Project: test
Schema: Table \"users\" (100 rows): id (UUID), email (VARCHAR)
Table \"posts\" (50 rows): id (UUID)
Stats: 2 tables, 3 columns, undefined records·

[Survived] ArithmeticOperator
src/lib/ai.js:381:72
 
     const totalTables = schema.length;
     const totalColumns = schema.reduce((sum, t) => sum + t.columns.length, 0);
-    const totalRows = Object.values(statistics).reduce((sum, count) => sum + count, 0);
+    const totalRows = Object.values(statistics).reduce((sum, count) => sum - count, 0);
     const relationships = schema.flatMap(t => t.columns.filter(c => c.foreign_table)).length;
 

[Survived] MethodExpression
src/lib/ai.js:382:47
     const totalTables = schema.length;
     const totalColumns = schema.reduce((sum, t) => sum + t.columns.length, 0);
     const totalRows = Object.values(statistics).reduce((sum, count) => sum + count, 0);
-    const relationships = schema.flatMap(t => t.columns.filter(c => c.foreign_table)).length;
+    const relationships = schema.flatMap(t => t.columns).length;
 
     const prompt = `Analyze this database and return a JSON summary.

[Survived] ArrowFunction
src/lib/ai.js:382:42
     const totalTables = schema.length;
     const totalColumns = schema.reduce((sum, t) => sum + t.columns.length, 0);
     const totalRows = Object.values(statistics).reduce((sum, count) => sum + count, 0);
-    const relationships = schema.flatMap(t => t.columns.filter(c => c.foreign_table)).length;
+    const relationships = schema.flatMap(() => undefined).length;
 
     const prompt = `Analyze this database and return a JSON summary.

[Survived] BlockStatement
src/lib/ai.js:413:43
 }
 export async function generateTitleFromSql(sqlQuery, schema) {
     // Prepare schema details so the AI understands the database structure
-    const schemaContext = schema.map(t => {
-        const columns = t.columns.map(c => `${c.name} (${c.type})`).join(', ');
-        return `Table "${t.name}": ${columns}`;
-    }).join('\n');
+    const schemaContext = schema.map(t => {}).join('\n');
 
     // Build the prompt that will be sent to the AI model

[Survived] ArrowFunction
src/lib/ai.js:414:39
 export async function generateTitleFromSql(sqlQuery, schema) {
     // Prepare schema details so the AI understands the database structure
     const schemaContext = schema.map(t => {
-        const columns = t.columns.map(c => `${c.name} (${c.type})`).join(', ');
+        const columns = t.columns.map(() => undefined).join(', ');
         return `Table "${t.name}": ${columns}`;
     }).join('\n');

[Killed] BlockStatement
src/lib/ai.js:436:9
 
 Generated Title:`;
 
-    try {
-        // Ask the AI model to generate the title
-        const { text } = await generateText({
-            model: groq(DEFAULT_MODEL),
-            prompt,
-            temperature: 0.3,
-            maxTokens: 100,
-        });
-
-        // Clean extra formatting from AI output
-        const cleanedTitle = cleanMarkdownCodeBlocks(text).replace(/^"|"$/g, '');
-
-        if (!cleanedTitle) {
-            throw new Error("AI returned an empty title.");
-        }
-
-        return cleanedTitle;
-
-    } catch {
+    try {} catch {
         // If AI fails, return a small part of SQL as fallback title
         return sqlQuery.substring(0, 50) + "...";
killedBy: ai library generateTitleFromSql should generate title from SQL query
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Get all HR department users"
Received: undefined

[Killed] StringLiteral
src/lib/ai.js:446:78
         });
 
         // Clean extra formatting from AI output
-        const cleanedTitle = cleanMarkdownCodeBlocks(text).replace(/^"|"$/g, '');
+        const cleanedTitle = cleanMarkdownCodeBlocks(text).replace(/^"|"$/g, "Stryker was here!");
 
         if (!cleanedTitle) {
killedBy: ai library generateTitleFromSql should clean markdown from title
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Count total orders"
Received: "Stryker was here!Count total ordersStryker was here!"

[Killed] ConditionalExpression
src/lib/ai.js:448:13
         // Clean extra formatting from AI output
         const cleanedTitle = cleanMarkdownCodeBlocks(text).replace(/^"|"$/g, '');
 
-        if (!cleanedTitle) {
+        if (false) {
             throw new Error("AI returned an empty title.");
         }
killedBy: ai library generateTitleFromSql should throw and use fallback when AI returns empty title
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "..."
Received string:    ""

[Killed] ConditionalExpression
src/lib/ai.js:448:13
         // Clean extra formatting from AI output
         const cleanedTitle = cleanMarkdownCodeBlocks(text).replace(/^"|"$/g, '');
 
-        if (!cleanedTitle) {
+        if (true) {
             throw new Error("AI returned an empty title.");
         }
killedBy: ai library generateTitleFromSql should generate title from SQL query
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Get all HR department users"
Received: "SELECT * FROM users WHERE department = \"HR\"..."

[Killed] BlockStatement
src/lib/ai.js:454:13
 
         return cleanedTitle;
 
-    } catch {
-        // If AI fails, return a small part of SQL as fallback title
-        return sqlQuery.substring(0, 50) + "...";
-    }
+    } catch {}
 }
 
killedBy: ai library generateTitleFromSql should return fallback on AI failure
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] MethodExpression
src/lib/ai.js:456:16
 
     } catch {
         // If AI fails, return a small part of SQL as fallback title
-        return sqlQuery.substring(0, 50) + "...";
+        return sqlQuery + "...";
     }
 }
killedBy: ai library generateTitleFromSql should return fallback on AI failure
statusReason: Error: expect(received).toBeLessThanOrEqual(expected)

Expected: <= 53
Received:    62

[Killed] StringLiteral
src/lib/ai.js:456:44
 
     } catch {
         // If AI fails, return a small part of SQL as fallback title
-        return sqlQuery.substring(0, 50) + "...";
+        return sqlQuery.substring(0, 50) + "";
     }
 }
killedBy: ai library generateTitleFromSql should return fallback on AI failure
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "..."
Received string:    "SELECT * FROM very_long_table_name_that_should_be_"

[Killed] BlockStatement
src/lib/ai.js:467:47
  */
 export async function generateOptimizationSuggestions(schema) {
     // Prepare detailed schema context for AI
-    const schemaContext = schema.map(table => {
-        const columns = table.columns.map(col => {
-            let colInfo = `${col.name} (${col.type})`;
-            if (col.constraints && col.constraints.length > 0) {
-                colInfo += ` [${col.constraints.join(', ')}]`;
-            }
-            if (col.references) {
-                colInfo += ` -> ${col.references}`;
-            }
-            return colInfo;
-        }).join('\n      ');
-        
-        return `Table: ${table.name}\n    Columns:\n      ${columns}`;
-    }).join('\n\n');
+    const schemaContext = schema.map(table => {}).join('\n\n');
 
     const prompt = `You are a database optimization expert. Analyze the following PostgreSQL database schema and provide optimization suggestions.
killedBy: ai library generatequerysuggestions Additional edge cases to improve mutation score generateOptimizationSuggestions should include reference arrows when references exist
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "-> users(id)"
Received string:    "You are a database optimization expert. Analyze the following PostgreSQL database schema and provide optimization suggestions.·
Database Schema:··
Analyze the schema and provide optimization suggestions in the following categories:·
1. **Missing Indexes**: Identify columns that would ben

[Killed] BlockStatement
src/lib/ai.js:468:50
 export async function generateOptimizationSuggestions(schema) {
     // Prepare detailed schema context for AI
     const schemaContext = schema.map(table => {
-        const columns = table.columns.map(col => {
-            let colInfo = `${col.name} (${col.type})`;
-            if (col.constraints && col.constraints.length > 0) {
-                colInfo += ` [${col.constraints.join(', ')}]`;
-            }
-            if (col.references) {
-                colInfo += ` -> ${col.references}`;
-            }
-            return colInfo;
-        }).join('\n      ');
+        const columns = table.columns.map(col => {}).join('\n      ');
         
         return `Table: ${table.name}\n    Columns:\n      ${columns}`;
killedBy: ai library generatequerysuggestions Additional edge cases to improve mutation score generateOptimizationSuggestions should include reference arrows when references exist
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "-> users(id)"
Received string:    "You are a database optimization expert. Analyze the following PostgreSQL database schema and provide optimization suggestions.·
Database Schema:
Table: x
    Columns:········
Analyze the schema and provide optimization suggestions in the following categories:·
