[Killed] BlockStatement
src/lib/ai.js:470:64
     const schemaContext = schema.map(table => {
         const columns = table.columns.map(col => {
             let colInfo = `${col.name} (${col.type})`;
-            if (col.constraints && col.constraints.length > 0) {
-                colInfo += ` [${col.constraints.join(', ')}]`;
-            }
+            if (col.constraints && col.constraints.length > 0) {}
             if (col.references) {
                 colInfo += ` -> ${col.references}`;
killedBy: ai library Mutation Resistance Tests generateOptimizationSuggestions structure validation should handle schema with column constraints
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "[PRIMARY KEY, NOT NULL]"
Received string:    "You are a database optimization expert. Analyze the following PostgreSQL database schema and provide optimization suggestions.·
Database Schema:
Table: users
    Columns:
      id (UUID)·

[Killed] EqualityOperator
src/lib/ai.js:470:36
     const schemaContext = schema.map(table => {
         const columns = table.columns.map(col => {
             let colInfo = `${col.name} (${col.type})`;
-            if (col.constraints && col.constraints.length > 0) {
+            if (col.constraints && col.constraints.length <= 0) {
                 colInfo += ` [${col.constraints.join(', ')}]`;
             }
killedBy: ai library Mutation Resistance Tests generateOptimizationSuggestions structure validation should handle schema with column constraints
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "[PRIMARY KEY, NOT NULL]"
Received string:    "You are a database optimization expert. Analyze the following PostgreSQL database schema and provide optimization suggestions.·
Database Schema:
Table: users
    Columns:
      id (UUID)·

[Killed] StringLiteral
src/lib/ai.js:471:28
         const columns = table.columns.map(col => {
             let colInfo = `${col.name} (${col.type})`;
             if (col.constraints && col.constraints.length > 0) {
-                colInfo += ` [${col.constraints.join(', ')}]`;
+                colInfo += ``;
             }
             if (col.references) {
killedBy: ai library Mutation Resistance Tests generateOptimizationSuggestions structure validation should handle schema with column constraints
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "[PRIMARY KEY, NOT NULL]"
Received string:    "You are a database optimization expert. Analyze the following PostgreSQL database schema and provide optimization suggestions.·
Database Schema:
Table: users
    Columns:
      id (UUID)·

[Killed] BlockStatement
src/lib/ai.js:473:33
             if (col.constraints && col.constraints.length > 0) {
                 colInfo += ` [${col.constraints.join(', ')}]`;
             }
-            if (col.references) {
-                colInfo += ` -> ${col.references}`;
-            }
+            if (col.references) {}
             return colInfo;
         }).join('\n      ');
killedBy: ai library generatequerysuggestions Additional edge cases to improve mutation score generateOptimizationSuggestions should include reference arrows when references exist
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "-> users(id)"
Received string:    "You are a database optimization expert. Analyze the following PostgreSQL database schema and provide optimization suggestions.·
Database Schema:
Table: x
    Columns:
      u (UUID)·

[Killed] ConditionalExpression
src/lib/ai.js:473:17
             if (col.constraints && col.constraints.length > 0) {
                 colInfo += ` [${col.constraints.join(', ')}]`;
             }
-            if (col.references) {
+            if (false) {
                 colInfo += ` -> ${col.references}`;
             }
killedBy: ai library generatequerysuggestions Additional edge cases to improve mutation score generateOptimizationSuggestions should include reference arrows when references exist
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "-> users(id)"
Received string:    "You are a database optimization expert. Analyze the following PostgreSQL database schema and provide optimization suggestions.·
Database Schema:
Table: x
    Columns:
      u (UUID)·

[Killed] ObjectLiteral
src/lib/ai.js:559:45
 - Be specific about the benefits of each optimization`;
 
     try {
-        const { text } = await generateText({
-            model: groq(DEFAULT_MODEL),
-            prompt,
-            temperature: 0.3,
-            maxTokens: 3000,
-        });
+        const { text } = await generateText({});
 
         const suggestions = parseAIResponse(text);
killedBy: ai library generatequerysuggestions Additional edge cases to improve mutation score generateOptimizationSuggestions should include reference arrows when references exist
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] BooleanLiteral
src/lib/ai.js:569:13
         const suggestions = parseAIResponse(text);
 
         // Validate structure
-        if (!suggestions || typeof suggestions !== 'object') {
+        if (suggestions || typeof suggestions !== 'object') {
             throw new Error('Invalid optimization suggestions structure');
         }
killedBy: ai library generatequerysuggestions Additional edge cases to improve mutation score generateOptimizationSuggestions should include reference arrows when references exist
statusReason: Error: Failed to generate optimization suggestions: Invalid optimization suggestions structure

[Killed] LogicalOperator
src/lib/ai.js:569:13
         const suggestions = parseAIResponse(text);
 
         // Validate structure
-        if (!suggestions || typeof suggestions !== 'object') {
+        if (!suggestions && typeof suggestions !== 'object') {
             throw new Error('Invalid optimization suggestions structure');
         }
killedBy: ai library Mutation Resistance Tests generateOptimizationSuggestions structure validation should handle non-object response
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"missingIndexes": [], "potentialIssues": [], "queryPerformance": [], "schemaImprovements": [], "totalSuggestions": 0}

[Killed] ConditionalExpression
src/lib/ai.js:575:31
 
         // Ensure all required fields exist with defaults
         const result = {
-            totalSuggestions: suggestions.totalSuggestions || 0,
+            totalSuggestions: true,
             queryPerformance: Array.isArray(suggestions.queryPerformance) ? suggestions.queryPerformance : [],
             missingIndexes: Array.isArray(suggestions.missingIndexes) ? suggestions.missingIndexes : [],
killedBy: ai library generateOptimizationSuggestions should generate optimization suggestions
statusReason: Error: expect(received).toBeGreaterThan(expected)

Matcher error: received value must be a number or bigint

Received has type:  boolean
Received has value: true

[Killed] LogicalOperator
src/lib/ai.js:575:31
 
         // Ensure all required fields exist with defaults
         const result = {
-            totalSuggestions: suggestions.totalSuggestions || 0,
+            totalSuggestions: suggestions.totalSuggestions && 0,
             queryPerformance: Array.isArray(suggestions.queryPerformance) ? suggestions.queryPerformance : [],
             missingIndexes: Array.isArray(suggestions.missingIndexes) ? suggestions.missingIndexes : [],
killedBy: ai library generateOptimizationSuggestions should provide default structure on empty response
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "number"
Received: "undefined"

[Survived] ArrayDeclaration
src/lib/ai.js:576:108
         // Ensure all required fields exist with defaults
         const result = {
             totalSuggestions: suggestions.totalSuggestions || 0,
-            queryPerformance: Array.isArray(suggestions.queryPerformance) ? suggestions.queryPerformance : [],
+            queryPerformance: Array.isArray(suggestions.queryPerformance) ? suggestions.queryPerformance : ["Stryker was here"],
             missingIndexes: Array.isArray(suggestions.missingIndexes) ? suggestions.missingIndexes : [],
             schemaImprovements: Array.isArray(suggestions.schemaImprovements) ? suggestions.schemaImprovements : [],

[Survived] ArrayDeclaration
src/lib/ai.js:578:114
             totalSuggestions: suggestions.totalSuggestions || 0,
             queryPerformance: Array.isArray(suggestions.queryPerformance) ? suggestions.queryPerformance : [],
             missingIndexes: Array.isArray(suggestions.missingIndexes) ? suggestions.missingIndexes : [],
-            schemaImprovements: Array.isArray(suggestions.schemaImprovements) ? suggestions.schemaImprovements : [],
+            schemaImprovements: Array.isArray(suggestions.schemaImprovements) ? suggestions.schemaImprovements : ["Stryker was here"],
             potentialIssues: Array.isArray(suggestions.potentialIssues) ? suggestions.potentialIssues : []
         };

[Killed] EqualityOperator
src/lib/ai.js:583:13
         };
 
         // Recalculate totalSuggestions if needed
-        if (result.totalSuggestions === 0) {
+        if (result.totalSuggestions !== 0) {
             result.totalSuggestions = 
                 result.missingIndexes.length + 
killedBy: ai library generateOptimizationSuggestions should recalculate totalSuggestions if zero
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] BlockStatement
src/lib/ai.js:583:44
         };
 
         // Recalculate totalSuggestions if needed
-        if (result.totalSuggestions === 0) {
-            result.totalSuggestions = 
-                result.missingIndexes.length + 
-                result.schemaImprovements.length + 
-                result.potentialIssues.length;
-        }
+        if (result.totalSuggestions === 0) {}
 
         return result;
killedBy: ai library generateOptimizationSuggestions should recalculate totalSuggestions if zero
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] ArithmeticOperator
src/lib/ai.js:585:17
         // Recalculate totalSuggestions if needed
         if (result.totalSuggestions === 0) {
             result.totalSuggestions = 
-                result.missingIndexes.length + 
-                result.schemaImprovements.length + 
+                result.missingIndexes.length - result.schemaImprovements.length + 
                 result.potentialIssues.length;
         }
killedBy: ai library generateOptimizationSuggestions should recalculate totalSuggestions if zero
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Survived] ArithmeticOperator
src/lib/ai.js:585:17
         // Recalculate totalSuggestions if needed
         if (result.totalSuggestions === 0) {
             result.totalSuggestions = 
-                result.missingIndexes.length + 
-                result.schemaImprovements.length + 
-                result.potentialIssues.length;
+                result.missingIndexes.length + result.schemaImprovements.length - result.potentialIssues.length;
         }
 

[Killed] BlockStatement
src/lib/ai.js:591:21
         }
 
         return result;
-    } catch (error) {
-        console.error('Error generating optimization suggestions:', error);
-        throw new Error(`Failed to generate optimization suggestions: ${error.message}`);
-    }
+    } catch (error) {}
 }
 
killedBy: ai library generateOptimizationSuggestions should throw error when AI fails
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
src/lib/ai.js:605:23
  * @returns {Promise<Object>} - Parsed error with user-friendly explanation
  */
 export async function parseDbError(errorMessage, sql = null, schema = null) {
-    const errorText = typeof errorMessage === 'string' ? errorMessage 
+    const errorText = true ? errorMessage 
     : errorMessage?.message || JSON.stringify(errorMessage);
 
killedBy: ai library parseDbError should parse error with Error object instead of string
statusReason: TypeError: errorText.substring is not a function

[Killed] ConditionalExpression
src/lib/ai.js:605:23
  * @returns {Promise<Object>} - Parsed error with user-friendly explanation
  */
 export async function parseDbError(errorMessage, sql = null, schema = null) {
-    const errorText = typeof errorMessage === 'string' ? errorMessage 
+    const errorText = false ? errorMessage 
     : errorMessage?.message || JSON.stringify(errorMessage);
 
killedBy: ai library generatequerysuggestions Additional edge cases to improve mutation score parseDbError fallback should include truncated long error and set flags correctly when schema/sql not provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] ConditionalExpression
src/lib/ai.js:606:7
  */
 export async function parseDbError(errorMessage, sql = null, schema = null) {
     const errorText = typeof errorMessage === 'string' ? errorMessage 
-    : errorMessage?.message || JSON.stringify(errorMessage);
+    : false;
 
     const schemaContext = schema && Array.isArray(schema) && schema.length > 0
killedBy: ai library parseDbError should parse error with Error object instead of string
statusReason: TypeError: errorText.substring is not a function

[Killed] LogicalOperator
src/lib/ai.js:606:7
  */
 export async function parseDbError(errorMessage, sql = null, schema = null) {
     const errorText = typeof errorMessage === 'string' ? errorMessage 
-    : errorMessage?.message || JSON.stringify(errorMessage);
+    : errorMessage?.message && JSON.stringify(errorMessage);
 
     const schemaContext = schema && Array.isArray(schema) && schema.length > 0
killedBy: ai library parseDbError should handle non-string, non-Error errorMessage with fallback
statusReason: TypeError: Cannot read properties of undefined (reading 'substring')

[Killed] EqualityOperator
src/lib/ai.js:608:62
     const errorText = typeof errorMessage === 'string' ? errorMessage 
     : errorMessage?.message || JSON.stringify(errorMessage);
 
-    const schemaContext = schema && Array.isArray(schema) && schema.length > 0
+    const schemaContext = schema && Array.isArray(schema) && schema.length <= 0
         ? `Database Schema Context:\n${schema.map(t => `Table "${t.name}": ${t.columns.map(c => c.name).join(', ')}`).join('\n')}`
         : 'Schema information: Unavailable';
killedBy: ai library Mutation Resistance Tests parseDbError context handling should handle schema with multiple tables in context
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Table \"users\""
Received string:    "You are a database error interpreter. Convert technical database·
    errors into simple, non-technical language that anyone can understand.·
Schema information: Unavailable·
SQL Query: Unavailable·
Database Error Message:

[Killed] ConditionalExpression
src/lib/ai.js:608:27
     const errorText = typeof errorMessage === 'string' ? errorMessage 
     : errorMessage?.message || JSON.stringify(errorMessage);
 
-    const schemaContext = schema && Array.isArray(schema) && schema.length > 0
+    const schemaContext = true
         ? `Database Schema Context:\n${schema.map(t => `Table "${t.name}": ${t.columns.map(c => c.name).join(', ')}`).join('\n')}`
         : 'Schema information: Unavailable';
killedBy: ai library generatequerysuggestions Additional edge cases to improve mutation score parseDbError fallback should include truncated long error and set flags correctly when schema/sql not provided
statusReason: TypeError: Cannot read properties of null (reading 'map')

[Killed] ArrowFunction
src/lib/ai.js:609:51
     : errorMessage?.message || JSON.stringify(errorMessage);
 
     const schemaContext = schema && Array.isArray(schema) && schema.length > 0
-        ? `Database Schema Context:\n${schema.map(t => `Table "${t.name}": ${t.columns.map(c => c.name).join(', ')}`).join('\n')}`
+        ? `Database Schema Context:\n${schema.map(() => undefined).join('\n')}`
         : 'Schema information: Unavailable';
 
killedBy: ai library Mutation Resistance Tests parseDbError context handling should handle schema with multiple tables in context
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Table \"users\""
Received string:    "You are a database error interpreter. Convert technical database·
    errors into simple, non-technical language that anyone can understand.·
Database Schema Context:···
SQL Query: Unavailable·
Database Error Message:

[Killed] ArrowFunction
src/lib/ai.js:609:92
     : errorMessage?.message || JSON.stringify(errorMessage);
 
     const schemaContext = schema && Array.isArray(schema) && schema.length > 0
-        ? `Database Schema Context:\n${schema.map(t => `Table "${t.name}": ${t.columns.map(c => c.name).join(', ')}`).join('\n')}`
+        ? `Database Schema Context:\n${schema.map(t => `Table "${t.name}": ${t.columns.map(() => undefined).join(', ')}`).join('\n')}`
         : 'Schema information: Unavailable';
 
killedBy: ai library Mutation Resistance Tests parseDbError context handling should handle schema with multiple tables in context
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "id, user_id"
Received string:    "You are a database error interpreter. Convert technical database·
    errors into simple, non-technical language that anyone can understand.·
Database Schema Context:
Table \"users\":·
Table \"posts\": ,··

[Killed] StringLiteral
src/lib/ai.js:610:11
 
     const schemaContext = schema && Array.isArray(schema) && schema.length > 0
         ? `Database Schema Context:\n${schema.map(t => `Table "${t.name}": ${t.columns.map(c => c.name).join(', ')}`).join('\n')}`
-        : 'Schema information: Unavailable';
+        : "";
 
     const sqlContext = sql  ? `SQL Query that caused the error:\n${sql}` : 'SQL Query: Unavailable';
killedBy: ai library parseDbError should show schema unavailable when not provided
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Schema information: Unavailable"
Received string:    "You are a database error interpreter. Convert technical database·
    errors into simple, non-technical language that anyone can understand.···
SQL Query: Unavailable·
Database Error Message:
\"test error\"·

[Killed] StringLiteral
src/lib/ai.js:612:76
         ? `Database Schema Context:\n${schema.map(t => `Table "${t.name}": ${t.columns.map(c => c.name).join(', ')}`).join('\n')}`
         : 'Schema information: Unavailable';
 
-    const sqlContext = sql  ? `SQL Query that caused the error:\n${sql}` : 'SQL Query: Unavailable';
+    const sqlContext = sql  ? `SQL Query that caused the error:\n${sql}` : "";
     const prompt = `You are a database error interpreter. Convert technical database 
     errors into simple, non-technical language that anyone can understand.
killedBy: ai library parseDbError should show schema unavailable when not provided
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "SQL Query: Unavailable"
Received string:    "You are a database error interpreter. Convert technical database·
    errors into simple, non-technical language that anyone can understand.·
Schema information: Unavailable···
Database Error Message:
\"test error\"·

[Survived] MethodExpression
src/lib/ai.js:644:25
   "userFriendlyExplanation": "2-3 sentences explaining the error in plain English, as if talking to someone with no technical background",
   "foreignKeyExplanation": "Only if foreign key error: 3-4 lines explaining the dependency issue in simple terms. Otherwise null.",
   "technicalDetails": {
-    "originalError": "${errorText.substring(0, 200)}...",
+    "originalError": "${errorText}...",
     "availableContext": {
       "schema": ${schema ? 'true' : 'false'},

[Survived] StringLiteral
src/lib/ai.js:646:28
   "technicalDetails": {
     "originalError": "${errorText.substring(0, 200)}...",
     "availableContext": {
-      "schema": ${schema ? 'true' : 'false'},
+      "schema": ${schema ? "" : 'false'},
       "sql": ${sql ? 'true' : 'false'}
     },

[Killed] BlockStatement
src/lib/ai.js:653:9
   }
 }`;
 
-    try {
-        const { text } = await generateText({
-            model: groq(DEFAULT_MODEL),
-            prompt,
-            temperature: 0.2,
-            maxTokens: 1500,
-        });
-
-        const parsed = parseAIResponse(text);
-
-        // Validate structure
-        if (!parsed || !parsed.errorType || !parsed.userFriendlyExplanation) {
-            throw new Error('Invalid error parsing response from AI');
-        }
-
-        return parsed;
-    } catch (error) {
+    try {} catch (error) {
         console.error('Error parsing database error:', error);
         // Fallback response if AI parsing fails
killedBy: ai library generatequerysuggestions Additional edge cases to improve mutation score parseDbError fallback should include truncated long error and set flags correctly when schema/sql not provided
statusReason: TypeError: Cannot read properties of undefined (reading 'errorType')

[Killed] ConditionalExpression
src/lib/ai.js:664:13
         const parsed = parseAIResponse(text);
 
         // Validate structure
-        if (!parsed || !parsed.errorType || !parsed.userFriendlyExplanation) {
+        if (true) {
             throw new Error('Invalid error parsing response from AI');
         }
killedBy: ai library parseDbError should parse foreign key violation error with full context
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Foreign Key Violation"
Received: "Unknown"

[Killed] BlockStatement
src/lib/ai.js:664:78
         const parsed = parseAIResponse(text);
 
         // Validate structure
-        if (!parsed || !parsed.errorType || !parsed.userFriendlyExplanation) {
-            throw new Error('Invalid error parsing response from AI');
-        }
+        if (!parsed || !parsed.errorType || !parsed.userFriendlyExplanation) {}
 
         return parsed;
killedBy: ai library parseDbError should handle invalid response structure with fallback
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Unknown"
Received: undefined

[Survived] StringLiteral
src/lib/ai.js:665:29
 
         // Validate structure
         if (!parsed || !parsed.errorType || !parsed.userFriendlyExplanation) {
-            throw new Error('Invalid error parsing response from AI');
+            throw new Error("");
         }
 

[Killed] BlockStatement
src/lib/ai.js:669:21
         }
 
         return parsed;
-    } catch (error) {
-        console.error('Error parsing database error:', error);
-        // Fallback response if AI parsing fails
-        return {
-            errorType: 'Unknown',
-            summary: 'An error occurred while processing your request',
-            userFriendlyExplanation: errorText.length > 200 
-                ? errorText.substring(0, 200) + '...' 
-                : errorText,
-            foreignKeyExplanation: null,
-            technicalDetails: {
-                originalError: errorText,
-                availableContext: {
-                    schema: !!schema,
-                    sql: !!sql
-                },
-                missingData: []
-            }
-        };
-    }
+    } catch (error) {}
 }
killedBy: ai library generatequerysuggestions Additional edge cases to improve mutation score parseDbError fallback should include truncated long error and set flags correctly when schema/sql not provided
statusReason: TypeError: Cannot read properties of undefined (reading 'errorType')

[Survived] StringLiteral
src/lib/ai.js:670:23
 
         return parsed;
     } catch (error) {
-        console.error('Error parsing database error:', error);
+        console.error("", error);
         // Fallback response if AI parsing fails
         return {

[Killed] ConditionalExpression
src/lib/ai.js:675:38
         return {
             errorType: 'Unknown',
             summary: 'An error occurred while processing your request',
-            userFriendlyExplanation: errorText.length > 200 
+            userFriendlyExplanation: false 
                 ? errorText.substring(0, 200) + '...' 
                 : errorText,
killedBy: ai library Mutation Resistance Tests parseDbError context handling should handle very long errors in fallback userFriendlyExplanation
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 203
Received length: 500

[Killed] ConditionalExpression
src/lib/ai.js:675:38
         return {
             errorType: 'Unknown',
             summary: 'An error occurred while processing your request',
-            userFriendlyExplanation: errorText.length > 200 
+            userFriendlyExplanation: true 
                 ? errorText.substring(0, 200) + '...' 
                 : errorText,
killedBy: ai library Mutation Resistance Tests parseDbError context handling should use short error as-is in fallback when under 200 chars
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "short error"
Received: "short error..."

[Killed] MethodExpression
src/lib/ai.js:676:19
             errorType: 'Unknown',
             summary: 'An error occurred while processing your request',
             userFriendlyExplanation: errorText.length > 200 
-                ? errorText.substring(0, 200) + '...' 
+                ? errorText + '...' 
                 : errorText,
             foreignKeyExplanation: null,
killedBy: ai library parseDbError should handle AI failure with fallback response
statusReason: Error: expect(received).toBeLessThanOrEqual(expected)

Expected: <= 300
Received:    303

[Killed] StringLiteral
src/lib/ai.js:676:49
             errorType: 'Unknown',
             summary: 'An error occurred while processing your request',
             userFriendlyExplanation: errorText.length > 200 
-                ? errorText.substring(0, 200) + '...' 
+                ? errorText.substring(0, 200) + "" 
                 : errorText,
             foreignKeyExplanation: null,
killedBy: ai library Mutation Resistance Tests parseDbError context handling should handle very long errors in fallback userFriendlyExplanation
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 203
Received length: 200
Received string: "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx"

[Killed] ObjectLiteral
src/lib/ai.js:679:31
                 ? errorText.substring(0, 200) + '...' 
                 : errorText,
             foreignKeyExplanation: null,
-            technicalDetails: {
-                originalError: errorText,
-                availableContext: {
-                    schema: !!schema,
-                    sql: !!sql
-                },
-                missingData: []
-            }
+            technicalDetails: {}
         };
     }
killedBy: ai library generatequerysuggestions Additional edge cases to improve mutation score parseDbError fallback should include truncated long error and set flags correctly when schema/sql not provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Received: undefined

[Killed] BooleanLiteral
src/lib/ai.js:682:30
             technicalDetails: {
                 originalError: errorText,
                 availableContext: {
-                    schema: !!schema,
+                    schema: !schema,
                     sql: !!sql
                 },
killedBy: ai library generatequerysuggestions Additional edge cases to improve mutation score parseDbError fallback should include truncated long error and set flags correctly when schema/sql not provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/lib/ai.js:683:27
                 originalError: errorText,
                 availableContext: {
                     schema: !!schema,
-                    sql: !!sql
+                    sql: !sql
                 },
                 missingData: []
killedBy: ai library generatequerysuggestions Additional edge cases to improve mutation score parseDbError fallback should include truncated long error and set flags correctly when schema/sql not provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true
